#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

[32m[1mSuccess![0m The configuration is valid.
[0m

```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.key-vault.data.azurerm_client_config.current: Reading...
module.resource-group.azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/f3be49af-c543-42e2-9b6d-6dce773995ff/resourceGroups/rg-module-dinkoli]
module.key-vault.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1jNzBkOTQwOS0wN2ExLTRhNWUtOTQ1NC1iNjA5MzIzNmJhOWY7b2JqZWN0SWQ9OWExMDRjYjQtODhhYi00MGM4LWJiNGItODlhYWRhYjU0NjhhO3N1YnNjcmlwdGlvbklkPWYzYmU0OWFmLWM1NDMtNDJlMi05YjZkLTZkY2U3NzM5OTVmZjt0ZW5hbnRJZD1hMzQ5YTkxNC0xNjNmLTQyMjEtODc3Yi02OWZmM2NjMmE2MWU=]
module.network.azurerm_virtual_network.myvnet: Refreshing state... [id=/subscriptions/f3be49af-c543-42e2-9b6d-6dce773995ff/resourceGroups/rg-module-dinkoli/providers/Microsoft.Network/virtualNetworks/dinko-vnet]
module.storage.azurerm_storage_account.account: Refreshing state... [id=/subscriptions/f3be49af-c543-42e2-9b6d-6dce773995ff/resourceGroups/rg-module-dinkoli/providers/Microsoft.Storage/storageAccounts/moduledinkolstorage]
module.network.azurerm_subnet.mysubnet: Refreshing state... [id=/subscriptions/f3be49af-c543-42e2-9b6d-6dce773995ff/resourceGroups/rg-module-dinkoli/providers/Microsoft.Network/virtualNetworks/dinko-vnet/subnets/dinko-subnet]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.key-vault.azurerm_key_vault.dinkokv will be created
  + resource "azurerm_key_vault" "dinkokv" {
      + access_policy                 = (known after apply)
      + id                            = (known after apply)
      + location                      = "westeurope"
      + name                          = "mykvdinkotest"
      + public_network_access_enabled = true
      + resource_group_name           = "rg-module-dinkoli"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 90
      + tenant_id                     = "a349a914-163f-4221-877b-69ff3cc2a61e"
      + vault_uri                     = (known after apply)

      + contact (known after apply)

      + network_acls (known after apply)
    }

  # module.key-vault.azurerm_key_vault_access_policy.dinkokvap will be created
  + resource "azurerm_key_vault_access_policy" "dinkokvap" {
      + id                  = (known after apply)
      + key_vault_id        = (known after apply)
      + object_id           = "9a104cb4-88ab-40c8-bb4b-89aadab5468a"
      + secret_permissions  = [
          + "Get",
          + "List",
          + "Set",
          + "Delete",
        ]
      + storage_permissions = [
          + "List",
        ]
      + tenant_id           = "a349a914-163f-4221-877b-69ff3cc2a61e"
    }

  # module.storage.azurerm_storage_account.account must be replaced
-/+ resource "azurerm_storage_account" "account" {
      ~ access_tier                        = "Hot" -> (known after apply)
      ~ account_replication_type           = "ZRS" -> "LRS" # forces replacement
      ~ id                                 = "/subscriptions/f3be49af-c543-42e2-9b6d-6dce773995ff/resourceGroups/rg-module-dinkoli/providers/Microsoft.Storage/storageAccounts/moduledinkolstorage" -> (known after apply)
      ~ large_file_share_enabled           = false -> (known after apply)
        name                               = "moduledinkolstorage"
      ~ primary_access_key                 = (sensitive value)
      ~ primary_blob_connection_string     = (sensitive value)
      ~ primary_blob_endpoint              = "https://moduledinkolstorage.blob.core.windows.net/" -> (known after apply)
      ~ primary_blob_host                  = "moduledinkolstorage.blob.core.windows.net" -> (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      ~ primary_connection_string          = (sensitive value)
      ~ primary_dfs_endpoint               = "https://moduledinkolstorage.dfs.core.windows.net/" -> (known after apply)
      ~ primary_dfs_host                   = "moduledinkolstorage.dfs.core.windows.net" -> (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      ~ primary_file_endpoint              = "https://moduledinkolstorage.file.core.windows.net/" -> (known after apply)
      ~ primary_file_host                  = "moduledinkolstorage.file.core.windows.net" -> (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      ~ primary_location                   = "westeurope" -> (known after apply)
      ~ primary_queue_endpoint             = "https://moduledinkolstorage.queue.core.windows.net/" -> (known after apply)
      ~ primary_queue_host                 = "moduledinkolstorage.queue.core.windows.net" -> (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      ~ primary_table_endpoint             = "https://moduledinkolstorage.table.core.windows.net/" -> (known after apply)
      ~ primary_table_host                 = "moduledinkolstorage.table.core.windows.net" -> (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      ~ primary_web_endpoint               = "https://moduledinkolstorage.z6.web.core.windows.net/" -> (known after apply)
      ~ primary_web_host                   = "moduledinkolstorage.z6.web.core.windows.net" -> (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      ~ secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      ~ secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      - tags                               = {} -> null
        # (21 unchanged attributes hidden)

      ~ blob_properties (known after apply)
      - blob_properties {
          - change_feed_enabled           = false -> null
          - change_feed_retention_in_days = 0 -> null
          - last_access_time_enabled      = false -> null
          - versioning_enabled            = false -> null
            # (1 unchanged attribute hidden)
        }

      ~ network_rules (known after apply)

      ~ queue_properties (known after apply)
      - queue_properties {
          - hour_metrics {
              - enabled               = true -> null
              - include_apis          = true -> null
              - retention_policy_days = 7 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      ~ routing (known after apply)

      ~ share_properties (known after apply)
      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }

      ~ static_website (known after apply)
    }

Plan: 3 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @dinkol, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform plan and apply with OIDC auth`*